tests/performance/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    # 预热阶段
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    
    # 负载测试阶段
    - duration: 300
      arrivalRate: 20
      name: "Load test"
    
    # 压力测试阶段
    - duration: 120
      arrivalRate: 50
      name: "Stress test"
    
    # 峰值测试阶段
    - duration: 60
      arrivalRate: 100
      name: "Spike test"

  # 性能指标阈值
  ensure:
    p95: 500  # 95%的请求响应时间小于500ms
    p99: 1000 # 99%的请求响应时间小于1000ms
    maxErrorRate: 1 # 错误率小于1%

  # 插件配置
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
    
scenarios:
  # 主页访问场景
  - name: "Homepage access"
    weight: 30
    flow:
      - get:
          url: "/"
          name: "Homepage"
      - think: 2

  # 用户认证场景
  - name: "User authentication"
    weight: 25
    flow:
      - get:
          url: "/auth/sign-in"
          name: "Sign in page"
      - think: 3
      - post:
          url: "/api/auth/sign-in"
          name: "Sign in API"
          json:
            email: "test{{ $randomInt(1, 1000) }}@example.com"
            password: "password123"
      - think: 2

  # 仪表板访问场景
  - name: "Dashboard access"
    weight: 20
    flow:
      - get:
          url: "/dashboard"
          name: "Dashboard"
          headers:
            Authorization: "Bearer mock-token"
      - think: 5
      - get:
          url: "/api/dashboard/stats"
          name: "Dashboard stats API"
          headers:
            Authorization: "Bearer mock-token"
      - think: 2

  # 文件管理场景
  - name: "File management"
    weight: 15
    flow:
      - get:
          url: "/dashboard/files"
          name: "Files page"
          headers:
            Authorization: "Bearer mock-token"
      - think: 3
      - get:
          url: "/api/files"
          name: "Files API"
          headers:
            Authorization: "Bearer mock-token"
      - think: 2

  # API健康检查场景
  - name: "Health check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          name: "Health check"
      - think: 1